Tekla Open API Reference for Tekla Structures 2025
AlongPartCenteredPlacingType Class
 The AlongPartCenteredPlacingType class defines a placing type that places the object using the along line placing. The line used will be the part's edge in the center of that line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.AlongPartCenteredPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AlongPartCenteredPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class AlongPartCenteredPlacingType
	Inherits PreferredPlacingTypeBase
The AlongPartCenteredPlacingType type exposes the following members.
Constructors
Name | Description
AlongPartCenteredPlacingType
 Creates a new along part centered placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace